In [14]:
#Objetivo: Classificar se uma pessoa comprou ou não comprou um produto com base no salério ou na idade

In [15]:
# importa bibloteca pandas
import pandas as pd

In [16]:
df= pd.read_csv('Social_Network_Ads.csv', sep=',') #importa a base de dados

In [17]:
df.head() #exibe as primeiras linhas do Dataframe)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [18]:
colunas = {'User ID': 'Usuario',    #Criação dos dicionarios
           'Gender': 'Genero',
           'Age': 'Idade', 'EstimatedSalary': 'Salario Estimado',
           'Purchased': 'Comprou'}

In [19]:
df.rename(columns=colunas,inplace=True) #renomeia as colunas

In [20]:
df.head()

    Usuario  Genero  Idade  Salario Estimado  Comprou
0  15624510    Male     19             19000        0
1  15810944    Male     35             20000        0
2  15668575  Female     26             43000        0
3  15603246  Female     27             57000        0
4  15804002    Male     19             76000        0